ErpTest/src/Documents/пкЗаданиеНаПеревозку/пкЗаданиеНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пкЗаданиеНаПеревозку</name>
  <basedOn>Catalog.ОбъектыЭксплуатации</basedOn>
  <basedOn>Document.пкЗаданиеНаПеревозку</basedOn>
  <registerRecords>InformationRegister.пкСтатусыТехники</registerRecords>
  <registerRecords>InformationRegister.пкСрокиАренды</registerRecords>
  <registerRecords>InformationRegister.пкРезервТехники</registerRecords>
  <registerRecords>AccumulationRegister.пкМоделиКДоставкеПоЗаявкамНаАрендуТехники</registerRecords>
  <registerRecords>AccumulationRegister.пкТехникаКПеремещениюМеждуРегионами</registerRecords>
  <registerRecords>InformationRegister.пкДатыАренды</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.пкВидыОперацийЗаданийНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаАрендуТехники</name>
    <type>
      <types>DocumentRef.пкЗаявкаНаАрендуТехники</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>РегионПолучатель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.пкЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный за доставку</comment>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.пкСтатусыЗаданийНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаменаТехники</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАренды</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьЗаказНарядНаОсмотр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаПодтверждена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеПодтверждения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоПодтвердил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КПроверке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтвержденоКлиентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийВодителю</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Повреждена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Повреждения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

ErpTest/src/InformationRegisters/пкРезервТехники/пкРезервТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкРезервТехники</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Резерв</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаявкаНаАрендуТехники</name>
    <type>
      <types>DocumentRef.пкЗаявкаНаАрендуТехники</types>
    </type>
  </resources>
  <dimensions>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/пкДатыАренды/пкДатыАренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкДатыАренды</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаАренды</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияАренды</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВозврата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭтоВозврат</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаявкаНаАрендуТехники</name>
    <type>
      <types>DocumentRef.пкЗаявкаНаАрендуТехники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/пкСтатусыТехники/пкСтатусыТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкСтатусыТехники</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.пкСтатусыТехники</types>
    </type>
  </resources>
  <resources>
    <name>ПланируемаяДатаЗавершения</name>
    <comment>Планируемая дата перехода в следующий статус (планируемая дата доставки, планируемая дата окончания ремонта)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаявкаНаАрендуТехники</name>
    <type>
      <types>DocumentRef.пкЗаявкаНаАрендуТехники</types>
    </type>
  </resources>
  <resources>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.пкЗаданиеНаПеревозку</types>
    </type>
  </resources>
  <dimensions>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/пкСрокиАренды/пкСрокиАренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкСрокиАренды</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЭтоОкончаниеАренды</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СрокАрендыВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.пкТипыДокументовДляСроковАренды</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоВозврат</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаявкаНаАрендуТехники</name>
    <type>
      <types>DocumentRef.пкЗаявкаНаАрендуТехники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерМодели</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗамены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/AccumulationRegisters/пкМоделиКДоставкеПоЗаявкамНаАрендуТехники/пкМоделиКДоставкеПоЗаявкамНаАрендуТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>пкМоделиКДоставкеПоЗаявкамНаАрендуТехники</name>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КВозврату</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Выгрузить</name>
    <comment>Выгрузить технику в указанном адресе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Погрузить</name>
    <comment>Забрать технику в указанном адресе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>DocumentRef.пкДоставка</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаявкаНаАрендуТехники</name>
    <type>
      <types>DocumentRef.пкЗаявкаНаАрендуТехники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.пкЗаданиеНаПеревозку</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/Enums/пкВидыОперацийЗаданийНаПеревозку/пкВидыОперацийЗаданийНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкВидыОперацийЗаданийНаПеревозку</name>
  <enumValues>
    <name>ДоставкаКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>Перекат</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМеждуРегионами</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/пкСтатусыЗаданийНаПеревозку/пкСтатусыЗаданийНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкСтатусыЗаданийНаПеревозку</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>КДоставке</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/пкСтатусыТехники/пкСтатусыТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкСтатусыТехники</name>
  <enumValues>
    <name>НаБазе</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>ВАренде</name>
  </enumValues>
  <enumValues>
    <name>КВозврату</name>
  </enumValues>
  <enumValues>
    <name>Недоступен</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/пкТипыДокументовДляСроковАренды/пкТипыДокументовДляСроковАренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкТипыДокументовДляСроковАренды</name>
  <enumValues>
    <name>ЗаявкаНаАрендуТехники</name>
  </enumValues>
  <enumValues>
    <name>ЗаказКлиента</name>
  </enumValues>
  <enumValues>
    <name>РеализацияТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>ПогрузкаВыгрузка</name>
  </enumValues>
  <enumValues>
    <name>ЗаданиеНаПеревозку</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Documents/пкЗаданиеНаПеревозку/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
///////////////////////////////////////////////////////////////////////
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
    КонецЕсли;
    
//Рарус Владимир Подрезов 09.10.2017 5502
	Если (НЕ ЭтоНовый())
			И Ссылка.ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.Перекат 
			И ВидОперации <> Перечисления.пкВидыОперацийЗаданийНаПеревозку.Перекат
	Тогда
		//сняли перекат
		Если ЗначениеЗаполнено(ЗаданиеНаПеревозку) Тогда
			//Выбранное задание - возврат
			тОбъект = ЗаданиеНаПеревозку.ПолучитьОбъект();
			тОбъект.ВидОперации				= Перечисления.пкВидыОперацийЗаданийНаПеревозку.ВозвратОтКлиента;
			тОбъект.ОбменДанными.Загрузка	= Истина;
			Попытка
				тОбъект.Записать(РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный);
			Исключение
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не удалось отменить перекат для задания %1.'"), тОбъект.Ссылка);
				ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка
					,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				тСообщение = Новый СообщениеПользователю;
				тСообщение.Текст = ОписаниеОшибки();
				тСообщение.Сообщить();
				Отказ = Истина;
				Возврат;
			КонецПопытки;
			Если тОбъект.Проведен Тогда
				тОбъект.ОбменДанными.Загрузка = Ложь;
				Попытка
					тОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				Исключение
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Не удалось отменить перекат для задания %1.'"), тОбъект.Ссылка);
					ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка
						,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					тСообщение = Новый СообщениеПользователю;
					тСообщение.Текст = ОписаниеОшибки();
					тСообщение.Сообщить();
					Отказ = Истина;
					Возврат;
				КонецПопытки;
			КонецЕсли;
			
			ЗаданиеНаПеревозку = "";
			
		Иначе
			//Текущее задание возврат, найдем все встречные и установим ДоставкуКлиенту
			ЗапросЗ = Новый Запрос;
			ЗапросЗ.Текст = 
			"ВЫБРАТЬ
			|	пкЗаданиеНаПеревозку.Ссылка
			|ИЗ
			|	Документ.пкЗаданиеНаПеревозку КАК пкЗаданиеНаПеревозку
			|ГДЕ
			|	пкЗаданиеНаПеревозку.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозку
			|	И пкЗаданиеНаПеревозку.Проведен
			|	И НЕ пкЗаданиеНаПеревозку.ПометкаУдаления";
			ЗапросЗ.УстановитьПараметр("ЗаданиеНаПеревозку", Ссылка);
			РезЗапроса = ЗапросЗ.Выполнить().Выбрать();
			Пока РезЗапроса.Следующий() Цикл
				тОбъект = РезЗапроса.Ссылка.ПолучитьОбъект();
				тОбъект.ВидОперации				= Перечисления.пкВидыОперацийЗаданийНаПеревозку.ДоставкаКлиенту;
				тОбъект.ЗаданиеНаПеревозку		= "";
				тОбъект.ОбменДанными.Загрузка	= Истина;
				Попытка
					тОбъект.Записать(РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный);
				Исключение
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Не удалось отменить перекат для задания %1.'"), тОбъект.Ссылка);
					ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка
						,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					тСообщение = Новый СообщениеПользователю;
					тСообщение.Текст = ОписаниеОшибки();
					тСообщение.Сообщить();
					Отказ = Истина;
					Возврат;
				КонецПопытки;
				Если тОбъект.Проведен Тогда
					тОбъект.ОбменДанными.Загрузка = Ложь;
					Попытка
						тОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
					Исключение
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Не удалось отменить перекат для задания %1.'"), тОбъект.Ссылка);
						ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка
							,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
						тСообщение = Новый СообщениеПользователю;
						тСообщение.Текст = ОписаниеОшибки();
						тСообщение.Сообщить();
						Отказ = Истина;
						Возврат;
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
//Рарус Владимир Подрезов Конец

    Если ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.ДоставкаКлиенту
      ИЛИ (ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.Перекат И НЕ ЗначениеЗаполнено(ЗаданиеНаПеревозку)) Тогда
        Дата = ЗаявкаНаАрендуТехники.Дата + 1;
    ИначеЕсли ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.ВозвратОтКлиента
      ИЛИ (ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.Перекат И ЗначениеЗаполнено(ЗаданиеНаПеревозку)) Тогда
        Дата = ЗаявкаНаАрендуТехники.Дата + 2;
    КонецЕсли;    
    
    Если ЗначениеЗаполнено(Ссылка) Тогда
        Если Ссылка.КПроверке Тогда
            КПроверке = Ложь; 
        КонецЕсли;    
    КонецЕсли;    

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;

//Рарус Владимир Подрезов 15.05.2017
	Если ЗначениеЗаполнено(Ссылка) И Год(Ссылка.Дата) <> Год(Дата) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
//Рарус Владимир Подрезов Конец
	
	Если ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.Перекат Тогда
		//СпособДоставки = Перечисления.СпособыДоставки.пкПерекатНаОбъекте;
	Иначе
		ЗаданиеНаПеревозку = "";
	КонецЕсли;
	
//Рарус Владимир Подрезов 18.09.2017
	Если ЗначениеЗаполнено(ЗаявкаНаАрендуТехники) И (НЕ ЗначениеЗаполнено(АдресДоставки)) Тогда
		АдресДоставки = ЗаявкаНаАрендуТехники.АдресДоставки;
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗаявкаНаАрендуТехники) И (НЕ ЗначениеЗаполнено(АдресДоставки)) И ЗначениеЗаполнено(ЗаявкаНаАрендуТехники.ОбъектСтроительства) Тогда
		АдресДоставки = ?(ЗаявкаНаАрендуТехники.ОбъектСтроительства.пкАдресДоставки = "", ЗаявкаНаАрендуТехники.ОбъектСтроительства.Наименование, ЗаявкаНаАрендуТехники.ОбъектСтроительства.пкАдресДоставки);
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗаявкаНаАрендуТехники) И (НЕ ЗначениеЗаполнено(КонтактноеЛицо)) Тогда
		КонтактноеЛицо = ЗаявкаНаАрендуТехники.КонтактноеЛицо;
	КонецЕсли;
//Рарус Владимир Подрезов Конец

	Если ЗначениеЗаполнено(ЗаданиеНаПеревозку) Тогда
		Если (Не ЗначениеЗаполнено(Техника)) И ЗначениеЗаполнено(ЗаданиеНаПеревозку.Техника) Тогда
			Техника = ЗаданиеНаПеревозку.Техника;
		КонецЕсли;
    КонецЕсли;
    
    Если НЕ ЗначениеЗаполнено(ДатаАренды) Тогда
        ДатаАренды = ДатаОтгрузки;    
    КонецЕсли; 
    
    Если РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ РольДоступна("пкПодтверждениеЗаявокНаАрендуТехники") И НЕ РольДоступна("ПолныеПрава") И НЕ РольДоступна("пкПолныеПрава")
      И ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.ДоставкаКлиенту
      И Статус = Перечисления.пкСтатусыЗаданийНаПеревозку.КДоставке Тогда
        Сообщить("Нет прав на отправку заданий в отдел логистики");
        Отказ = Истина;
    КонецЕсли; 
    
    Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ЗначениеЗаполнено(Техника) И НЕ Отказ Тогда
        Если ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.ДоставкаКлиенту  Тогда
            Запрос = Новый Запрос;
            Запрос.Текст = 
            "ВЫБРАТЬ
            |   пкРезервТехникиСрезПоследних.Резерв,
            |   пкРезервТехникиСрезПоследних.ЗаявкаНаАрендуТехники
            |ИЗ
            |   РегистрСведений.пкРезервТехники.СрезПоследних(
            |           &Дата,
            |           Регистратор <> &Ссылка
            |               И Техника = &Техника) КАК пкРезервТехникиСрезПоследних";
            
            Запрос.УстановитьПараметр("Дата",    ДатаОтгрузки);
            Запрос.УстановитьПараметр("Техника", Техника);
            Запрос.УстановитьПараметр("Ссылка",  Ссылка);
            
            Результат = Запрос.Выполнить();
            Выборка = Результат.Выбрать();
            
            Если Выборка.Следующий() Тогда
                Если Выборка.Резерв Тогда
                    Сообщить("Техника """ + Техника + """ уже зарезервирована под " + Выборка.ЗаявкаНаАрендуТехники);
                    Отказ = Истина;
                КонецЕсли;    
            КонецЕсли;
        ИначеЕсли ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.ВозвратОтКлиента Тогда
            Запрос = Новый Запрос;
            Запрос.Текст = 
            "ВЫБРАТЬ
            |   пкДатыАрендыСрезПоследних.Регистратор КАК ЗаданиеНаПеревозку
            |ИЗ
            |   РегистрСведений.пкДатыАренды.СрезПоследних(
            |           ,
            |           ЗаявкаНаАрендуТехники = &ЗаявкаНаАрендуТехники
            |               И Техника = &Техника
            |               И ЭтоВозврат
            |               И Регистратор.Техника = ЗНАЧЕНИЕ(Справочник.ОбъектыЭксплуатации.ПустаяСсылка)
            |               И Регистратор <> &Ссылка) КАК пкДатыАрендыСрезПоследних";
            
            Запрос.УстановитьПараметр("Ссылка",                Ссылка);
            Запрос.УстановитьПараметр("Техника",               Техника);
            Запрос.УстановитьПараметр("ЗаявкаНаАрендуТехники", ЗаявкаНаАрендуТехники);
            
            Результат = Запрос.Выполнить();
            Выборка = Результат.Выбрать();
            
            Если Выборка.Следующий() Тогда
                ЗаданиеСВыбраннойТехникой = Выборка.ЗаданиеНаПеревозку.ПолучитьОбъект();
                
                Если Ссылка.ЗаявкаНаАрендуТехники <> ЗаявкаНаАрендуТехники Тогда
                    ЗаданиеСВыбраннойТехникой.ЗаявкаНаАрендуТехники = Ссылка.ЗаявкаНаАрендуТехники; 
                    
                    Попытка
                        ЗаданиеСВыбраннойТехникой.Записать(РежимЗаписиДокумента.Проведение);
                    Исключение
                    КонецПопытки;
                Иначе 
                    Запрос = Новый Запрос;
                    Запрос.Текст =
                    "ВЫБРАТЬ ПЕРВЫЕ 1
                    |   пкСтатусыТехникиСрезПоследних.Техника
                    |ИЗ
                    |   РегистрСведений.пкСтатусыТехники.СрезПоследних(
                    |           ,
                    |           (Статус = ЗНАЧЕНИЕ(Перечисление.пкСтатусыТехники.ВАренде)
                    |               ИЛИ Статус = ЗНАЧЕНИЕ(Перечисление.пкСтатусыТехники.КОтгрузке)
                    |               ИЛИ Статус = ЗНАЧЕНИЕ(Перечисление.пкСтатусыТехники.ВПути))
                    |               И ЗаявкаНаАрендуТехники = &ЗаявкаНаАрендуТехники
                    |               И Техника.пкМодель = &Модель
                    |               И Техника <> &Техника) КАК пкСтатусыТехникиСрезПоследних
                    |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.пкДатыАренды.СрезПоследних(
                    |               ,
                    |               ЭтоВозврат) КАК пкДатыАрендыСрезПоследних
                    |       ПО пкСтатусыТехникиСрезПоследних.Техника = пкДатыАрендыСрезПоследних.Техника
                    |           И пкСтатусыТехникиСрезПоследних.ЗаявкаНаАрендуТехники = пкДатыАрендыСрезПоследних.ЗаявкаНаАрендуТехники
                    |ГДЕ
                    |   пкДатыАрендыСрезПоследних.Техника ЕСТЬ NULL
                    |
                    |УПОРЯДОЧИТЬ ПО
                    |   пкСтатусыТехникиСрезПоследних.ПланируемаяДатаЗавершения";
                    
                    Запрос.УстановитьПараметр("ЗаявкаНаАрендуТехники", ЗаявкаНаАрендуТехники);
                    Запрос.УстановитьПараметр("Модель",                Модель);
                    Запрос.УстановитьПараметр("Техника",               Техника);

                    Результат = Запрос.Выполнить();
                    Выборка = Результат.Выбрать();
                    
                    Если Выборка.Следующий() Тогда
                        ЗаданиеСВыбраннойТехникой.Техника = Выборка.Техника;
                        
                        Попытка
                            ЗаданиеСВыбраннойТехникой.Записать(РежимЗаписиДокумента.Проведение);
                        Исключение
                        КонецПопытки;
                    Иначе
                        ЗаданиеСВыбраннойТехникой.КПроверке = Истина;
                        
                        Попытка
                            ЗаданиеСВыбраннойТехникой.Записать(РежимЗаписиДокумента.Проведение);
                        Исключение
                        КонецПопытки;
                    КонецЕсли;
                КонецЕсли;
            КонецЕсли;        
		ИначеЕсли ЗначениеЗаполнено(ДатаОтгрузки) И ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.ПеремещениеМеждуРегионами Тогда
			СтатусТехники = пкУправлениеТехникойСервер.ПолучитьСтатусТехники(Техника,ДатаОтгрузки);
				Если СтатусТехники <> Перечисления.пкСтатусыТехники.НаБазе Тогда
			 		Сообщить("Данная техника "+Строка(Техника)+" в статусе "+Строка(СтатусТехники)+", уточните технику.");
					//Отказ = Истина;
				КонецЕсли;	
		КонецЕсли;    
    КонецЕсли;  
    
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("ЗаявкаНаАрендуТехники")
			И ЗначениеЗаполнено(ДанныеЗаполнения.ЗаявкаНаАрендуТехники)
		Тогда
			
		    ВидОперации				= Перечисления.пкВидыОперацийЗаданийНаПеревозку.ДоставкаКлиенту;
			ДатаОтгрузки			= ТекущаяДата() + 1 * 24*60*60; //На завтра
			ЗаявкаНаАрендуТехники	= ДанныеЗаполнения.ЗаявкаНаАрендуТехники;
			
			Модель					= "";
			Техника					= "";
			
			РегионПолучатель		= "";
			
			АдресДоставки			= ДанныеЗаполнения.ЗаявкаНаАрендуТехники.АдресДоставки;
			СпособДоставки			= ДанныеЗаполнения.ЗаявкаНаАрендуТехники.СпособДоставки;
			
			ВремяДоставкиС			= "";
			ВремяДоставкиПо 		= "";
            
			Если Не ЗначениеЗаполнено(Подразделение) Тогда
	            Подразделение           = ДанныеЗаполнения.ЗаявкаНаАрендуТехники.ПодразделениеОтгрузки;
			КонецЕсли;
				
		КонецЕсли;
		
		//На случай, когда все определено в Данных заполнения - оно имеет больший приоритет!
		Для Каждого КлючИЗначение Из ДанныеЗаполнения Цикл
			Если ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
				ЭтотОбъект[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
		
			ВидОперации 			= Перечисления.пкВидыОперацийЗаданийНаПеревозку.ПеремещениеМеждуРегионами;
			ДатаОтгрузки			= ТекущаяДата() + 1 * 24*60*60; //На завтра
			
			ЗаявкаНаАрендуТехники	= "";
			ЗаданиеНаПеревозку 		= "";
			
			Модель					= ДанныеЗаполнения.пкМодель;
			Техника					= ДанныеЗаполнения;
			
			РегионПолучатель		= "";
			
			АдресДоставки			= "";
			СпособДоставки			= "";
			
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.пкЗаданиеНаПеревозку") Тогда
		
		Если ДанныеЗаполнения.ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.Перекат Тогда
			
			ВидОперации 			= Перечисления.пкВидыОперацийЗаданийНаПеревозку.Перекат;
			ДатаОтгрузки			= ДанныеЗаполнения.ДатаОтгрузки;
			
			ЗаявкаНаАрендуТехники	= "";
			ЗаданиеНаПеревозку 		= ДанныеЗаполнения.Ссылка;
			
			Модель					= "";
			Техника					= "";
			
			РегионПолучатель		= "";
			
			АдресДоставки			= "";
			СпособДоставки			= ДанныеЗаполнения.СпособДоставки;
			
		Иначе //Возврат
			//ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(ЭтотОбъект, ДанныеЗаполнения);
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , "Проведен, ПометкаУдаления, Номер, Дата, Подразделение, СкладПолучатель");
			
			Если ДанныеЗаполнения.ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.ДоставкаКлиенту Тогда
				ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.ВозвратОтКлиента;
			ИначеЕсли ДанныеЗаполнения.ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.ВозвратОтКлиента Тогда
				ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.ДоставкаКлиенту;
			КонецЕсли;
			
			СпособДоставки	= ДанныеЗаполнения.СпособДоставки;
				
			//тСтрокиПоКоду = пкУправлениеТехникойСервер.ПолучитьСтруктуруСтрокиЗаявкиНаТехнику(ДанныеЗаполнения.ЗаявкаНаАрендуТехники, ДанныеЗаполнения.КодСтроки);
			//Если тСтрокиПоКоду <> Неопределено Тогда
			//	ДатаОтгрузки	= ?(ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.ВозвратОтКлиента, тСтрокиПоКоду.ДатаВозврата, тСтрокиПоКоду.ДатаОтгрузки);
			//КонецЕсли;
			
		КонецЕсли;
		
		//Это точно необходимо указывать пользователю
		ВремяДоставкиС	= "";
		ВремяДоставкиПо = "";
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидОперации) Тогда
		ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.ДоставкаКлиенту;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		Подразделение = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Пользователи.ТекущийПользователь());
	КонецЕсли;
	
	Дата = ТекущаяДата();
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ПроверяемыеРеквизиты.Добавить("Подразделение");
	ПроверяемыеРеквизиты.Добавить("ВидОперации");
	ПроверяемыеРеквизиты.Добавить("ДатаОтгрузки");
//Рарус Владимир Подрезов 18.09.2017
//	ПроверяемыеРеквизиты.Добавить("АдресДоставки");
//Рарус Владимир Подрезов Конец
	ПроверяемыеРеквизиты.Добавить("Модель");
	
	Если (ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.ДоставкаКлиенту) Тогда
		
		ПроверяемыеРеквизиты.Добавить("ЗаявкаНаАрендуТехники");
		
	ИначеЕсли (ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.ВозвратОтКлиента) Тогда
		
		ПроверяемыеРеквизиты.Добавить("ЗаявкаНаАрендуТехники");
		
	ИначеЕсли (ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.Перекат) Тогда
		
		ПроверяемыеРеквизиты.Добавить("ЗаявкаНаАрендуТехники");
		
		Если ЗначениеЗаполнено(ЗаданиеНаПеревозку) Тогда
			Отказ = Отказ ИЛИ Не Документы.пкЗаданиеНаПеревозку.СоотвествиеДанныхМоделиИТехники(ЭтотОбъект, ЗаданиеНаПеревозку);
		//Иначе
		//	
		//	ЗапросПерекат = Новый Запрос;
		//	ЗапросПерекат.Текст = 
		//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		//	|	пкЗаданиеНаПеревозку.Ссылка
		//	|ИЗ
		//	|	Документ.пкЗаданиеНаПеревозку КАК пкЗаданиеНаПеревозку
		//	|ГДЕ
		//	|	пкЗаданиеНаПеревозку.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозку
		//	|	И НЕ пкЗаданиеНаПеревозку.ПометкаУдаления
		//	|	И пкЗаданиеНаПеревозку.Проведен";
		//	ЗапросПерекат.УстановитьПараметр("ЗаданиеНаПеревозку", ЭтотОбъект.Ссылка);
		//	РезЗапроса = ЗапросПерекат.Выполнить().Выбрать();
		//	Пока РезЗапроса.Следующий() Цикл
		//		Отказ = Отказ ИЛИ Не Документы.пкЗаданиеНаПеревозку.СоотвествиеДанныхМоделиИТехники(ЭтотОбъект, РезЗапроса.Ссылка);
		//	КонецЦикла;
		//	
		КонецЕсли;
		
	ИначеЕсли (ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.ПеремещениеМеждуРегионами) Тогда
		
		ПроверяемыеРеквизиты.Добавить("РегионПолучатель");
		ПроверяемыеРеквизиты.Добавить("Техника");
		
    КонецЕсли;
    
    //+++rarus-spb_zlov 12.09.2016    
    Если ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.ВозвратОтКлиента 
      ИЛИ ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.ПеремещениеМеждуРегионами Тогда
		ПроверяемыеРеквизиты.Добавить("СкладПолучатель");
    КонецЕсли;  
    //---rarus-spb_zlov 12.09.2016 
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
    Документы.пкЗаданиеНаПеревозку.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
    ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
    
    Если НЕ КПроверке Тогда
        Документы.пкЗаданиеНаПеревозку.Отразить_пкМоделиКДоставкеПоЗаявкамНаАрендуТехники(ДополнительныеСвойства, Движения, Отказ);
        Документы.пкЗаданиеНаПеревозку.Отразить_пкТехникаКПеремещениюМеждуРегионами(ДополнительныеСвойства, Движения, Отказ);
    КонецЕсли;
    
    СформироватьСписокРегистровДляКонтроля();
    ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
    ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
    Документы.пкЗаданиеНаПеревозку.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
    ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
    
    Если НЕ КПроверке Тогда
        РегистрыСведений.пкРезервТехники.СформироватьЗаписи(Отказ, РежимПроведения, ЭтотОбъект);
        РегистрыСведений.пкСтатусыТехники.СформироватьЗаписи(Отказ, РежимПроведения, ЭтотОбъект);
        РегистрыСведений.пкДатыАренды.СформироватьЗаписи(Отказ, РежимПроведения, ЭтотОбъект);
        
        РегистрыСведений.пкСрокиАренды.СформироватьЗаписи(ЭтотОбъект, Отказ, РежимПроведения);
   КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	СформироватьСписокРегистровДляКонтроля();
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.Перекат Тогда
		ЗапросПерекат = Новый Запрос;
		ЗапросПерекат.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	пкЗаданиеНаПеревозку.Ссылка
		|ИЗ
		|	Документ.пкЗаданиеНаПеревозку КАК пкЗаданиеНаПеревозку
		|ГДЕ
		|	пкЗаданиеНаПеревозку.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозку
		|	И НЕ пкЗаданиеНаПеревозку.ПометкаУдаления
		|	И пкЗаданиеНаПеревозку.Проведен";
		ЗапросПерекат.УстановитьПараметр("ЗаданиеНаПеревозку", ЭтотОбъект.Ссылка);
		РезЗапроса = ЗапросПерекат.Выполнить().Выбрать();
		Пока РезЗапроса.Следующий() Цикл
			тОбъект = РезЗапроса.Ссылка.ПолучитьОбъект();
			
			тОбъект.Техника = Техника;
			Попытка
				тОбъект.Записать(?(тОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись), РежимПроведенияДокумента.Неоперативный);
			Исключение
				
				тСообщение = Новый СообщениеПользователю;
				тСообщение.Текст = ОписаниеОшибки();
				тСообщение.Сообщить();
				
				Отказ = Истина;
				Возврат;
				
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	Если Проведен Тогда
		
		//Перепроведем Погрузки/выгрузки
		ЗапросОперации = Новый Запрос;
		ЗапросОперации.Текст = 
		"ВЫБРАТЬ
		|	пкПогрузкаВыгрузкаПоДоставке.Ссылка
		|ИЗ
		|	Документ.пкПогрузкаВыгрузкаПоДоставке КАК пкПогрузкаВыгрузкаПоДоставке
		|ГДЕ
		|	пкПогрузкаВыгрузкаПоДоставке.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозку
		|	И пкПогрузкаВыгрузкаПоДоставке.Проведен
		|	И НЕ пкПогрузкаВыгрузкаПоДоставке.ПометкаУдаления";
		ЗапросОперации.УстановитьПараметр("ЗаданиеНаПеревозку", Ссылка);
		РезЗапроса = ЗапросОперации.Выполнить().Выбрать();
		Пока РезЗапроса.Следующий() Цикл
			тОбъект = РезЗапроса.Ссылка.ПолучитьОбъект();
			Попытка
				тОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				
				тСообщение = Новый СообщениеПользователю;
				тСообщение.Текст = ОписаниеОшибки();
				тСообщение.Сообщить();
				
				Отказ = Истина;
				Возврат;
				
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
//Рарус Владимир Подрезов 11.10.2017 5505
	Если Проведен Тогда
		
		Если ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.ДоставкаКлиенту
			ИЛИ ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.Перекат
				И ЗначениеЗаполнено(ЗаданиеНаПеревозку)
		Тогда
			
			//Перепроведем Задания на возврат: определять будем по модели и заявке через сроки аренды
			ЗапросВозврат = Новый Запрос;
			ЗапросВозврат.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Возврат.Регистратор КАК Ссылка
			|ИЗ
			|	РегистрСведений.пкСрокиАренды.СрезПоследних(
			|			,
			|			ЗаявкаНаАрендуТехники = &ЗаявкаНаАрендуТехники
			|				И Модель = &Модель
			|				И ТипДокумента = ЗНАЧЕНИЕ(Перечисление.пкТипыДокументовДляСроковАренды.ЗаданиеНаПеревозку)
			|				И НЕ ЭтоОкончаниеАренды) КАК Отгрузка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.пкСрокиАренды.СрезПоследних(
			|				,
			|				ЗаявкаНаАрендуТехники = &ЗаявкаНаАрендуТехники
			|					И Модель = &Модель
			|					И ТипДокумента = ЗНАЧЕНИЕ(Перечисление.пкТипыДокументовДляСроковАренды.ЗаданиеНаПеревозку)
			|					И ЭтоОкончаниеАренды) КАК Возврат
			|		ПО Отгрузка.ЗаявкаНаАрендуТехники = Возврат.ЗаявкаНаАрендуТехники
			|			И Отгрузка.Модель = Возврат.Модель
			|			И Отгрузка.НомерМодели = Возврат.НомерМодели
			|ГДЕ
			|	НЕ Возврат.Регистратор ЕСТЬ NULL";
			ЗапросВозврат.УстановитьПараметр("ЗаявкаНаАрендуТехники", ЗаявкаНаАрендуТехники);
			ЗапросВозврат.УстановитьПараметр("Модель", Модель);
			РезЗапроса = ЗапросВозврат.Выполнить().Выбрать();
			Пока РезЗапроса.Следующий() Цикл
				тОбъект = РезЗапроса.Ссылка.ПолучитьОбъект();
				Попытка
					тОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				Исключение
					
					тСообщение = Новый СообщениеПользователю;
					тСообщение.Текст = ОписаниеОшибки();
					тСообщение.Сообщить();
					
					Отказ = Истина;
					Возврат;
					
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
//Рарус Владимир Подрезов Конец

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		Подразделение	= ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Пользователи.ТекущийПользователь());
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный	= Пользователи.ТекущийПользователь();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Автор) Тогда
		Автор 			= Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
#Область Прочее

Процедура СформироватьСписокРегистровДляКонтроля()
	
	Массив = Новый Массив;
	
	Массив.Добавить(Движения.пкМоделиКДоставкеПоЗаявкамНаАрендуТехники);
	//Массив.Добавить(Движения.пкТехникаКПеремещениюМеждуРегионами);
	
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры

#КонецОбласти
#КонецОбласти
#КонецЕсли
